In [1]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv(r'C:\Users\Asus\Desktop\programming work\LetsUpgrade\Day-16,17\Assingment\titles.csv')

In [3]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [6]:
titles.title.count()

244914

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.nsmallest(2, 'year')

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

In [8]:
cpy = titles.copy()

### How many movies have the title "Hamlet"?

In [9]:
cpy[cpy.title == "Hamlet"].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [10]:

cpy[cpy.title == "North by Northwest"]

                    title  year
74398  North by Northwest  1959

### When was the first movie titled "Hamlet" made?

In [11]:
cpy[cpy.title == "Hamlet"].nsmallest(1, 'year')

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [12]:
cpy[cpy.title == "Treasure Island"].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [13]:
cpy[cpy.year == 1959].count()

title    1515
year     1515
dtype: int64

### How many movies were made in the year 1960?

In [14]:
cpy[cpy.year == 1960].count()

title    1549
year     1549
dtype: int64

### How many movies were made from 1950 through 1959?

In [15]:
cpy[cpy.year.between(1950,1959)].count()

title    12934
year     12934
dtype: int64

### In what years has a movie titled "Batman" been released?

In [16]:
cpy[cpy.title =='Batman'].year

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [17]:
 cast = pd.read_csv('cast.csv')

In [21]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [31]:
 inception  = cast[cast.title =='Inception'].copy()

In [40]:
inception.head()

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

In [33]:
#check for duplicates
inception[inception.duplicated()]

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

In [34]:
inception.count()
# the answer is 78

title        78
year         78
name         78
type         78
character    78
n            51
dtype: int64

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [42]:
inception[inception.n.isnull()].count()
# Answer is 27

title        27
year         27
name         27
type         27
character    27
n             0
dtype: int64

### But how many roles in the movie "Inception" did receive an "n" value?

In [44]:
inception[inception.n.isnull()== False].count()
# Answer is 51

title        51
year         51
name         51
type         51
character    51
n            51
dtype: int64

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [58]:
north_by_northwest = cast[cast.title == 'North by Northwest'].sort_values('n', ascending = False).copy()

In [63]:
north_by_northwest

,title,year,name,type,character,n
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
...,...,...,...,...,...,...
3441077,North by Northwest,1959,Maudie Prickett,actress,Elsie - Maid,NaN
3577128,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3599912,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3739133,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3751311,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

In [60]:
north_by_northwest.count()

title        116
year         116
name         116
type         116
character    116
n             16
dtype: int64

In [62]:
north_by_northwest.dropna(axis = 0)

,title,year,name,type,character,n
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [67]:
sleuth = cast[cast.title== 'Sleuth'].copy().sort_values('n')

In [68]:
sleuth

,title,year,name,type,character,n
326774,Sleuth,2007,Michael Caine,actor,Andrew,1.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
1293634,Sleuth,2007,Jude Law,actor,Milo,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1805907,Sleuth,2007,Harold Pinter,actor,Man on T.V.,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
260242,Sleuth,2007,Kenneth Branagh,actor,Other Man on T.V.,NaN
373877,Sleuth,2007,Alec (II) Cawthorne,actor,Inspector Doppler,NaN
2724552,Sleuth,2007,Eve (II) Channing,actress,Marguerite Wyke,NaN
3370424,Sleuth,2007,Carmel O'Sullivan,actress,Maggie,NaN

In [70]:
sleuth.dropna(axis=0)

,title,year,name,type,character,n
326774,Sleuth,2007,Michael Caine,actor,Andrew,1.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
1293634,Sleuth,2007,Jude Law,actor,Milo,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1805907,Sleuth,2007,Harold Pinter,actor,Man on T.V.,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [73]:
sleuth[sleuth.year == 2007].dropna(axis = 0)

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [82]:
hamlet = cast[(cast.title == 'Hamlet') & (cast.year==1921)].count()

In [83]:
hamlet

title        9
year         9
name         9
type         9
character    9
n            9
dtype: int64

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [84]:
hamlet = cast[(cast.title == 'Hamlet') & (cast.year==1996)]

In [86]:
hamlet.count()
# answer is 54

title        54
year         54
name         54
type         54
character    54
n            46
dtype: int64

### How many "Hamlet" roles have been listed in all film credits through history?

In [89]:
all_hamlet  =  cast[cast.title == 'Hamlet'].count()
all_hamlet

title        342
year         342
name         342
type         342
character    342
n            249
dtype: int64

### How many people have played an "Ophelia"?

In [97]:
cast[cast.title == 'Ophelia'].count()

title        20
year         20
name         20
type         20
character    20
n             0
dtype: int64

In [99]:
cast[cast.title == 'Ophelia']['name'].unique().shape
# answer is 19

(19,)

### How many people have played a role called "The Dude"?

In [102]:
cast[cast.character == 'The Dude'].count()

title        19
year         19
name         19
type         19
character    19
n            12
dtype: int64

### How many people have played a role called "The Stranger"?

In [105]:
cast[cast.character == 'The Stranger'].count()

title        212
year         212
name         212
type         212
character    212
n            133
dtype: int64

### How many roles has Sidney Poitier played throughout his career?

In [107]:
cast[cast.name == 'Sidney Poitier'].count()
# 43

title        43
year         43
name         43
type         43
character    43
n            42
dtype: int64

### How many roles has Judi Dench played?

In [113]:
cast[cast.name == 'Judi Dench']['character'].unique().shape[0]

46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [125]:
cast[(cast.name == 'Cary Grant') & (cast.year.between(1940,1949, inclusive= True) & (cast.n==2))].sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [128]:
cast[(cast.name == 'Cary Grant') & (cast.year.between(1940,1949, inclusive= True))& \
    (cast.n == 1)].sort_values('year')

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [135]:
cast[(cast.year.between(1950,1959, inclusive = True)) & (cast.type == 'actor')].n.count()

82079

### How many roles were available for actresses in the 1950s?

In [136]:
cast[(cast.year.between(1950,1959, inclusive = True)) & (cast.type == 'actress')].n.count()

35794

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [138]:
cast[(cast.year>=1980) & (cast.n==1)].n.count()

89276

### How many non-leading roles were available through from the beginning of film history through 1980?

In [142]:
cast[(cast.year>=1980) & (~(cast.n==1))].n.count()

1522873

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [147]:
cast[(cast.year>=1980) & (cast.n.isnull())].count()
#answer is 10104692

title        1014692
year         1014692
name         1014692
type         1014692
character    1014692
n                  0
dtype: int64